jmeter/jmeter-scripts/Reports/statistics.json
{
  "Get Request" : {
    "transaction" : "Get Request",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 799.0,
    "medianResTime" : 799.0,
    "minResTime" : 799.0,
    "maxResTime" : 799.0,
    "pct1ResTime" : 799.0,
    "pct2ResTime" : 799.0,
    "pct3ResTime" : 799.0,
    "throughput" : 1.2515644555694618,
    "receivedKBytesPerSec" : 0.9948959637046307,
    "sentKBytesPerSec" : 0.18944579161451813
  },
  "Put Request" : {
    "transaction" : "Put Request",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 271.0,
    "medianResTime" : 271.0,
    "minResTime" : 271.0,
    "maxResTime" : 271.0,
    "pct1ResTime" : 271.0,
    "pct2ResTime" : 271.0,
    "pct3ResTime" : 271.0,
    "throughput" : 3.6900369003690034,
    "receivedKBytesPerSec" : 4.486421817343173,
    "sentKBytesPerSec" : 0.738728090405904
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3,
    "errorCount" : 1,
    "errorPct" : 33.333332,
    "meanResTime" : 443.0,
    "medianResTime" : 271.0,
    "minResTime" : 259.0,
    "maxResTime" : 799.0,
    "pct1ResTime" : 799.0,
    "pct2ResTime" : 799.0,
    "pct3ResTime" : 799.0,
    "throughput" : 2.243829468960359,
    "receivedKBytesPerSec" : 2.425702365370232,
    "sentKBytesPerSec" : 0.41560513275991023
  },
  "Post  Request" : {
    "transaction" : "Post  Request",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 259.0,
    "medianResTime" : 259.0,
    "minResTime" : 259.0,
    "maxResTime" : 259.0,
    "pct1ResTime" : 259.0,
    "pct2ResTime" : 259.0,
    "pct3ResTime" : 259.0,
    "throughput" : 3.8610038610038613,
    "receivedKBytesPerSec" : 4.758385617760617,
    "sentKBytesPerSec" : 0.7880369208494208
  }
}